zephyrproject-rtos/zephyr/drivers/can/can_esp32_twaifd.c
/*
 * Copyright (c) 2026 Espressif Systems (Shanghai) Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT espressif_esp32_twaifd

#include <zephyr/drivers/can.h>
#include <zephyr/drivers/can/transceiver.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/interrupt_controller/intc_esp32.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/pm/policy.h>
#include <zephyr/sys/util.h>

#include <soc.h>
#include <esp_clk_tree.h>
#include <hal/twai_hal.h>
#include <hal/twaifd_ll.h>
#include <hal/twai_types.h>
#include <soc/soc_caps.h>

#if defined(CONFIG_ESP32_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP) &&                               \
	defined(SOC_TWAI_SUPPORT_SLEEP_RETENTION)
#define CAN_ESP32_TWAIFD_SLEEP_RETENTION_ENABLED 1
#else
#define CAN_ESP32_TWAIFD_SLEEP_RETENTION_ENABLED 0
#endif

#if CAN_ESP32_TWAIFD_SLEEP_RETENTION_ENABLED
#include <esp_private/sleep_retention.h>
#include <hal/twai_periph.h>
#endif

LOG_MODULE_REGISTER(can_esp32_twaifd, CONFIG_CAN_LOG_LEVEL);

#define CAN_ESP32_TWAIFD_MAX_FILTER CONFIG_CAN_ESP32_TWAIFD_MAX_FILTERS

/*
 * Number of hardware TXT buffers used as a transmit pool. The controller has
 * up to 4 TXT buffers on ESP32-C5. All buffers are left at equal priority so
 * the controller arbitrates pending frames on the bus by CAN ID, the same way
 * the Bosch M_CAN based drivers rely on hardware arbitration rather than a
 * software priority field.
 */
#define CAN_ESP32_TWAIFD_TX_BUFFERS 4U

/* TXT buffer status codes returned by twaifd_ll_get_tx_buffer_status(). */
#define CAN_ESP32_TWAIFD_TXT_TOK 0x4U
#define CAN_ESP32_TWAIFD_TXT_ERR 0x6U

/* Secondary sample point offset register is 8 bits wide. */
#define CAN_ESP32_TWAIFD_SSP_MAX 255U

struct can_esp32_twaifd_filter {
	struct can_filter filter;
	can_rx_callback_t cb;
	void *user_data;
};

struct can_esp32_twaifd_tx_ctx {
	can_tx_callback_t cb;
	void *user_data;
};

struct can_esp32_twaifd_config {
	const struct can_driver_config common;
	mm_reg_t base;
	int controller_id;
	const struct device *clock_dev;
	clock_control_subsys_t clock_subsys;
	const struct pinctrl_dev_config *pcfg;
	int irq_source;
	int irq_priority;
	int irq_flags;
};

struct can_esp32_twaifd_data {
	struct can_driver_data common;
	twai_hal_context_t hal;
	struct k_mutex lock;
	struct k_sem tx_sem;
	struct can_esp32_twaifd_tx_ctx tx_ctx[CAN_ESP32_TWAIFD_TX_BUFFERS];
	struct can_esp32_twaifd_filter filters[CAN_ESP32_TWAIFD_MAX_FILTER];
	uint32_t clock_source_hz;
	uint8_t tx_buffer_count;
	enum can_state state;
	intr_handle_t intr_handle;
	bool pm_lock_held;
};

static void can_esp32_twaifd_pm_policy_state_lock_get(const struct device *dev)
{
	struct can_esp32_twaifd_data *data = dev->data;
	unsigned int key = irq_lock();

	if (!data->pm_lock_held) {
		data->pm_lock_held = true;
		pm_policy_state_all_lock_get();
	}

	irq_unlock(key);
}

static void can_esp32_twaifd_pm_policy_sync_lock(const struct device *dev)
{
	struct can_esp32_twaifd_data *data = dev->data;
	unsigned int key = irq_lock();
	bool must_lock = data->common.started;

	if (must_lock && !data->pm_lock_held) {
		data->pm_lock_held = true;
		pm_policy_state_all_lock_get();
	} else if (!must_lock && data->pm_lock_held) {
		data->pm_lock_held = false;
		pm_policy_state_all_lock_put();
	}

	irq_unlock(key);
}

static int can_esp32_twaifd_get_core_clock(const struct device *dev, uint32_t *rate)
{
	struct can_esp32_twaifd_data *data = dev->data;

	*rate = data->clock_source_hz;
	return 0;
}

static int can_esp32_twaifd_get_capabilities(const struct device *dev, can_mode_t *cap)
{
	ARG_UNUSED(dev);

	*cap = CAN_MODE_NORMAL | CAN_MODE_LOOPBACK | CAN_MODE_LISTENONLY | CAN_MODE_ONE_SHOT;

	if (IS_ENABLED(CONFIG_CAN_FD_MODE)) {
		*cap |= CAN_MODE_FD;
	}

	if (IS_ENABLED(CONFIG_CAN_MANUAL_RECOVERY_MODE)) {
		*cap |= CAN_MODE_MANUAL_RECOVERY;
	}

	return 0;
}

static int can_esp32_twaifd_get_max_filters(const struct device *dev, bool ide)
{
	ARG_UNUSED(dev);
	ARG_UNUSED(ide);

	return CAN_ESP32_TWAIFD_MAX_FILTER;
}

static int can_esp32_twaifd_set_mode(const struct device *dev, can_mode_t mode)
{
	struct can_esp32_twaifd_data *data = dev->data;
	can_mode_t caps = 0;
	int err;

	if (data->common.started) {
		return -EBUSY;
	}

	err = can_esp32_twaifd_get_capabilities(dev, &caps);
	if (err != 0) {
		return err;
	}

	if ((mode & ~caps) != 0) {
		return -ENOTSUP;
	}

	k_mutex_lock(&data->lock, K_FOREVER);
	data->common.mode = mode;

	/*
	 * No HAL setter for mode after init; program the LL directly. Self-test
	 * is enabled together with internal loopback so the controller ACKs its
	 * own frames; without it, loopback tests on a single TX/RX wire (no
	 * transceiver) would fail with ACK errors. The Zephyr CAN mode API has
	 * no separate self-test bit, so the two are tied.
	 */
	twaifd_ll_set_mode(data->hal.dev, !!(mode & CAN_MODE_LISTENONLY),
			   !!(mode & CAN_MODE_LOOPBACK), !!(mode & CAN_MODE_LOOPBACK));
	twaifd_ll_set_tx_retrans_limit(data->hal.dev, (mode & CAN_MODE_ONE_SHOT) ? 0 : -1);

	/*
	 * Mirror mode into the HAL context so HAL state-tracking helpers see
	 * the new configuration. This couples to HAL-private fields; if the
	 * HAL ever exposes a twai_hal_set_mode() helper, switch to it.
	 */
	data->hal.enable_loopback = !!(mode & CAN_MODE_LOOPBACK);
	data->hal.enable_self_test = !!(mode & CAN_MODE_LOOPBACK);
	data->hal.enable_listen_only = !!(mode & CAN_MODE_LISTENONLY);

	k_mutex_unlock(&data->lock);

	return 0;
}

static int can_esp32_twaifd_set_timing(const struct device *dev, const struct can_timing *timing)
{
	struct can_esp32_twaifd_data *data = dev->data;
	twai_timing_advanced_config_t t = {
		.brp = timing->prescaler,
		.prop_seg = timing->prop_seg,
		.tseg_1 = timing->phase_seg1,
		.tseg_2 = timing->phase_seg2,
		.sjw = timing->sjw,
		.ssp_offset = 0,
	};

	if (data->common.started) {
		return -EBUSY;
	}

	k_mutex_lock(&data->lock, K_FOREVER);
	twai_hal_configure_timing(&data->hal, &t);
	k_mutex_unlock(&data->lock);

