zephyrproject-rtos/zephyr/drivers/can/can_esp32_twaifd.c
	return 0;
}

#ifdef CONFIG_CAN_FD_MODE
static int can_esp32_twaifd_set_timing_data(const struct device *dev,
					    const struct can_timing *timing_data)
{
	struct can_esp32_twaifd_data *data = dev->data;
	twai_timing_advanced_config_t t = {
		.brp = timing_data->prescaler,
		.prop_seg = timing_data->prop_seg,
		.tseg_1 = timing_data->phase_seg1,
		.tseg_2 = timing_data->phase_seg2,
		.sjw = timing_data->sjw,
		/* Transmitter delay compensation: the secondary sample point is
		 * the controller-measured transmitter delay (TDC) plus a fixed
		 * offset (TDCO). Only the TDCO is configured here; ssp_offset
		 * carries it in time quanta. CAN_CALC_TDCO() returns the offset
		 * in minimum time quanta (clock cycles), so divide by the
		 * prescaler to convert to time quanta. The TDCO max is scaled by
		 * the prescaler so the clamp lands on CAN_ESP32_TWAIFD_SSP_MAX
		 * after the division.
		 */
		.ssp_offset = CAN_CALC_TDCO(timing_data, 0U,
					    CAN_ESP32_TWAIFD_SSP_MAX * timing_data->prescaler) /
			      timing_data->prescaler,
	};

	if (data->common.started) {
		return -EBUSY;
	}

	k_mutex_lock(&data->lock, K_FOREVER);
	twai_hal_configure_timing_fd(&data->hal, &t);
	k_mutex_unlock(&data->lock);

	return 0;
}
#endif /* CONFIG_CAN_FD_MODE */

static int can_esp32_twaifd_start(const struct device *dev)
{
	const struct can_esp32_twaifd_config *cfg = dev->config;
	struct can_esp32_twaifd_data *data = dev->data;
	int err;

	if (data->common.started) {
		return -EALREADY;
	}

	can_esp32_twaifd_pm_policy_state_lock_get(dev);

	if (cfg->common.phy != NULL) {
		err = can_transceiver_enable(cfg->common.phy, data->common.mode);
		if (err != 0) {
			LOG_ERR("failed to enable CAN transceiver (err %d)", err);
			can_esp32_twaifd_pm_policy_sync_lock(dev);
			return err;
		}
	}

	CAN_STATS_RESET(dev);

	k_mutex_lock(&data->lock, K_FOREVER);
	/*
	 * twai_hal_start() polls the fault-state-change interrupt to wait
	 * for the 11 recessive bit bus integration. Keep the ISR disabled
	 * across this window so it cannot consume the FCSI status bit
	 * before the poll observes it; re-enable right after.
	 */
	twai_hal_start(&data->hal);
	data->state = CAN_STATE_ERROR_ACTIVE;
	k_mutex_unlock(&data->lock);

	err = esp_intr_enable(data->intr_handle);
	if (err != 0) {
		LOG_ERR("failed to enable TWAI interrupt (err %d)", err);
		k_mutex_lock(&data->lock, K_FOREVER);
		twai_hal_stop(&data->hal);
		k_mutex_unlock(&data->lock);
		if (cfg->common.phy != NULL) {
			(void)can_transceiver_disable(cfg->common.phy);
		}
		can_esp32_twaifd_pm_policy_sync_lock(dev);
		return err;
	}

	/*
	 * Flip started last so send() cannot observe a startable controller
	 * until the ISR is live to complete the TX.
	 */
	data->common.started = true;

	return 0;
}

static int can_esp32_twaifd_stop(const struct device *dev)
{
	const struct can_esp32_twaifd_config *cfg = dev->config;
	struct can_esp32_twaifd_data *data = dev->data;
	int err;

	if (!data->common.started) {
		return -EALREADY;
	}

	err = esp_intr_disable(data->intr_handle);
	if (err != 0) {
		LOG_ERR("failed to disable TWAI interrupt (err %d)", err);
		return err;
	}

	k_mutex_lock(&data->lock, K_FOREVER);
	twai_hal_stop(&data->hal);
	data->common.started = false;

	/*
	 * Abort any pending transmissions. twai_hal_stop() disables the
	 * controller which returns every TXT buffer to the Empty state, so
	 * the callbacks installed here will not race a late TX-done.
	 */
	for (uint8_t i = 0; i < data->tx_buffer_count; i++) {
		can_tx_callback_t cb = data->tx_ctx[i].cb;
		void *user_data = data->tx_ctx[i].user_data;

		if (cb != NULL) {
			data->tx_ctx[i].cb = NULL;
			cb(dev, -ENETDOWN, user_data);
			k_sem_give(&data->tx_sem);
		}
	}
	k_mutex_unlock(&data->lock);

	can_esp32_twaifd_pm_policy_sync_lock(dev);

	if (cfg->common.phy != NULL) {
		err = can_transceiver_disable(cfg->common.phy);
		if (err != 0) {
			LOG_ERR("failed to disable CAN transceiver (err %d)", err);
			return err;
		}
	}

	return 0;
}

static int can_esp32_twaifd_get_state(const struct device *dev, enum can_state *state,
				      struct can_bus_err_cnt *err_cnt)
{
	struct can_esp32_twaifd_data *data = dev->data;

	if (state != NULL) {
		if (!data->common.started) {
			*state = CAN_STATE_STOPPED;
		} else {
			*state = data->state;
		}
	}

	if (err_cnt != NULL) {
		err_cnt->tx_err_cnt = twai_hal_get_tec(&data->hal);
		err_cnt->rx_err_cnt = twai_hal_get_rec(&data->hal);
	}

	return 0;
}

#ifdef CONFIG_CAN_MANUAL_RECOVERY_MODE
static int can_esp32_twaifd_recover(const struct device *dev, k_timeout_t timeout)
{
	struct can_esp32_twaifd_data *data = dev->data;

	ARG_UNUSED(timeout);

	if (!data->common.started) {
		return -ENETDOWN;
	}

	if ((data->common.mode & CAN_MODE_MANUAL_RECOVERY) == 0U) {
		return -ENOTSUP;
	}

	k_mutex_lock(&data->lock, K_FOREVER);
	twai_hal_start_bus_recovery(&data->hal);
	k_mutex_unlock(&data->lock);

	return 0;
}
#endif /* CONFIG_CAN_MANUAL_RECOVERY_MODE */

static int can_esp32_twaifd_send(const struct device *dev, const struct can_frame *frame,
				 k_timeout_t timeout, can_tx_callback_t callback, void *user_data)
{
	struct can_esp32_twaifd_data *data = dev->data;
	uint8_t frame_buf[CAN_MAX_DLEN];
	twai_hal_frame_t hw_frame = {0};
	twai_frame_header_t header = {0};
	twai_hal_trans_desc_t desc = {
		.frame.header = &header,
		.frame.buffer = frame_buf,
		.frame.buffer_len = 0,
	};
	uint8_t dlc;
	uint8_t data_len;
	int buffer_id = -1;

	if (!data->common.started) {
		return -ENETDOWN;
	}

	if ((frame->flags & ~(CAN_FRAME_IDE | CAN_FRAME_RTR | CAN_FRAME_FDF | CAN_FRAME_BRS)) !=
	    0) {
		return -ENOTSUP;
	}

	if ((frame->flags & CAN_FRAME_FDF) != 0) {
		if (!IS_ENABLED(CONFIG_CAN_FD_MODE)) {
			return -ENOTSUP;
		}
		if ((data->common.mode & CAN_MODE_FD) == 0) {
			return -ENOTSUP;
		}
		if (frame->dlc > CANFD_MAX_DLC) {
			return -EINVAL;
		}
	} else {
		if (frame->dlc > CAN_MAX_DLC) {
			return -EINVAL;
		}
		if ((frame->flags & CAN_FRAME_BRS) != 0) {
			return -ENOTSUP;
		}
	}

	dlc = frame->dlc;
	data_len = can_dlc_to_bytes(dlc);

