zephyrproject-rtos/zephyr/drivers/can/can_esp32_twaifd.c
	header.id = frame->id;
	header.dlc = dlc;
	header.ide = !!(frame->flags & CAN_FRAME_IDE);
	header.rtr = !!(frame->flags & CAN_FRAME_RTR);
	header.fdf = !!(frame->flags & CAN_FRAME_FDF);
	header.brs = !!(frame->flags & CAN_FRAME_BRS);

	if (!header.rtr) {
		memcpy(frame_buf, frame->data, data_len);
		desc.frame.buffer_len = data_len;
	}

	if (k_sem_take(&data->tx_sem, timeout) != 0) {
		return -EAGAIN;
	}

	k_mutex_lock(&data->lock, K_FOREVER);

	/*
	 * A free TXT buffer is guaranteed because tx_sem (counting available
	 * buffers) was just acquired. The mutex serializes concurrent send()
	 * and stop() callers; ISR safety instead relies on writing cb before
	 * issuing the transmit, and on the ISR clearing the slot and giving
	 * the sem before this slot can be reselected.
	 */
	for (uint8_t i = 0; i < data->tx_buffer_count; i++) {
		if (data->tx_ctx[i].cb == NULL) {
			buffer_id = i;
			break;
		}
	}
	__ASSERT_NO_MSG(buffer_id >= 0);

	desc.config.retry_cnt = (data->common.mode & CAN_MODE_ONE_SHOT) ? 0 : -1;
	data->tx_ctx[buffer_id].cb = callback;
	data->tx_ctx[buffer_id].user_data = user_data;

	twai_hal_format_frame(&desc, &hw_frame);
	twai_hal_set_tx_buffer_and_transmit(&data->hal, &hw_frame, (uint8_t)buffer_id);
	k_mutex_unlock(&data->lock);

	return 0;
}

static int can_esp32_twaifd_add_rx_filter(const struct device *dev, can_rx_callback_t callback,
					  void *user_data, const struct can_filter *filter)
{
	struct can_esp32_twaifd_data *data = dev->data;
	int filter_id = -ENOSPC;

	if (callback == NULL) {
		return -EINVAL;
	}

	if ((filter->flags & ~(CAN_FILTER_IDE)) != 0) {
		return -ENOTSUP;
	}

	k_mutex_lock(&data->lock, K_FOREVER);
	for (int i = 0; i < CAN_ESP32_TWAIFD_MAX_FILTER; i++) {
		if (data->filters[i].cb == NULL) {
			data->filters[i].filter = *filter;
			data->filters[i].user_data = user_data;
			/*
			 * cb is written last so the ISR observing cb != NULL
			 * also observes the matching filter and user_data.
			 */
			data->filters[i].cb = callback;
			filter_id = i;
			break;
		}
	}
	k_mutex_unlock(&data->lock);

	return filter_id;
}

static void can_esp32_twaifd_remove_rx_filter(const struct device *dev, int filter_id)
{
	struct can_esp32_twaifd_data *data = dev->data;

	if (filter_id < 0 || filter_id >= CAN_ESP32_TWAIFD_MAX_FILTER) {
		return;
	}

	k_mutex_lock(&data->lock, K_FOREVER);
	/*
	 * cb is cleared first so the ISR sees the slot as inactive before
	 * filter and user_data become stale.
	 */
	data->filters[filter_id].cb = NULL;
	data->filters[filter_id].user_data = NULL;
	data->filters[filter_id].filter = (struct can_filter){0};
	k_mutex_unlock(&data->lock);
}

static void IRAM_ATTR can_esp32_twaifd_handle_rx(const struct device *dev)
{
	struct can_esp32_twaifd_data *data = dev->data;
	twai_hal_frame_t rx_frame;
	twai_frame_header_t header;
	struct can_frame frame;
	uint8_t buffer[CAN_MAX_DLEN];

	while (twai_hal_get_rx_msg_count(&data->hal) > 0) {
		if (!twai_hal_read_rx_fifo(&data->hal, &rx_frame)) {
			continue;
		}

		memset(&frame, 0, sizeof(frame));
		twai_hal_parse_frame(&data->hal, &rx_frame, &header, buffer, sizeof(buffer));

		frame.id = header.id;
		frame.dlc = header.dlc;
		frame.flags = (header.ide ? CAN_FRAME_IDE : 0) | (header.rtr ? CAN_FRAME_RTR : 0) |
			      (header.fdf ? CAN_FRAME_FDF : 0) | (header.brs ? CAN_FRAME_BRS : 0) |
			      (header.esi ? CAN_FRAME_ESI : 0);

		if (!header.rtr) {
			memcpy(frame.data, buffer,
			       MIN(can_dlc_to_bytes(header.dlc), sizeof(frame.data)));
		}

#ifdef CONFIG_CAN_RX_TIMESTAMP
		/*
		 * The hardware timestamp is 64-bit; can_frame.timestamp is
		 * 16-bit by API design so the low word wraps every ~65k
		 * ticks of the configured CAN timer.
		 */
		frame.timestamp = (uint16_t)header.timestamp;
#endif

		if (!IS_ENABLED(CONFIG_CAN_ACCEPT_RTR) && (frame.flags & CAN_FRAME_RTR) != 0) {
			continue;
		}

		for (int i = 0; i < CAN_ESP32_TWAIFD_MAX_FILTER; i++) {
			can_rx_callback_t cb = data->filters[i].cb;
			void *cb_user_data = data->filters[i].user_data;
			struct can_filter f;

			if (cb == NULL) {
				continue;
			}
			f = data->filters[i].filter;
			if (can_frame_matches_filter(&frame, &f)) {
				cb(dev, &frame, cb_user_data);
			}
		}
	}
}

/*
 * The TX-done interrupt is global: it does not identify which TXT buffer
 * completed. Scan the in-use buffers, read each one's status register, and
 * complete the ones that reached the TX-OK or TX-Failed terminal state.
 */
static void IRAM_ATTR can_esp32_twaifd_handle_tx(const struct device *dev)
{
	struct can_esp32_twaifd_data *data = dev->data;

	for (uint8_t i = 0; i < data->tx_buffer_count; i++) {
		can_tx_callback_t cb = data->tx_ctx[i].cb;
		void *user_data = data->tx_ctx[i].user_data;
		uint32_t raw;
		uint32_t status;
		int tx_status;

		if (cb == NULL) {
			continue;
		}

		raw = twaifd_ll_get_tx_buffer_status(data->hal.dev, i);
		status = (raw >> (i * TWAIFD_TX2S_S)) & TWAIFD_TX2S_V;

		if (status != CAN_ESP32_TWAIFD_TXT_TOK && status != CAN_ESP32_TWAIFD_TXT_ERR) {
			continue;
		}

		tx_status = (status == CAN_ESP32_TWAIFD_TXT_TOK) ? 0 : -EIO;

		/*
		 * Return the TXT buffer to the Empty state so the next transmit
		 * request can transition it to Ready. The hardware disallows a
		 * direct TX_OK -> Ready transition.
		 */
		twaifd_ll_set_tx_buffer_cmd(data->hal.dev, i, TWAIFD_LL_TX_CMD_EMPTY);

		/*
		 * Clear cb before signaling the buffer is free; the next send()
		 * can only claim this slot after the sem is given, so it always
		 * observes the cleared slot before installing its own callback.
		 */
		data->tx_ctx[i].cb = NULL;
		cb(dev, tx_status, user_data);
		k_sem_give(&data->tx_sem);
	}
}

static void IRAM_ATTR can_esp32_twaifd_update_state(const struct device *dev, uint32_t events)
{
	struct can_esp32_twaifd_data *data = dev->data;
	enum can_state new_state = data->state;
	struct can_bus_err_cnt err_cnt;

	if (events & TWAI_HAL_EVENT_BUS_OFF) {
		new_state = CAN_STATE_BUS_OFF;
	} else if (events & TWAI_HAL_EVENT_ERROR_PASSIVE) {
		new_state = CAN_STATE_ERROR_PASSIVE;
	} else if (events & TWAI_HAL_EVENT_ERROR_WARNING) {
		new_state = CAN_STATE_ERROR_WARNING;
	} else if (events & TWAI_HAL_EVENT_ERROR_ACTIVE) {
		new_state = CAN_STATE_ERROR_ACTIVE;
	}

	if (new_state == data->state) {
		return;
	}

