zephyrproject-rtos/zephyr/drivers/can/can_esp32_twaifd.c
	LOG_DBG("bus state change: %d -> %d", data->state, new_state);
	data->state = new_state;

	/*
	 * On bus-off the controller forces every TXT buffer to the TX-Failed
	 * state, so abort the pending transmissions and release their slots.
	 * When manual recovery is not requested, trigger recovery from here so
	 * the controller re-integrates automatically after the bus heals.
	 */
	if (new_state == CAN_STATE_BUS_OFF) {
		for (uint8_t i = 0; i < data->tx_buffer_count; i++) {
			can_tx_callback_t tx_cb = data->tx_ctx[i].cb;
			void *tx_user_data = data->tx_ctx[i].user_data;

			if (tx_cb != NULL) {
				data->tx_ctx[i].cb = NULL;
				tx_cb(dev, -ENETUNREACH, tx_user_data);
				k_sem_give(&data->tx_sem);
			}
		}

		if (!IS_ENABLED(CONFIG_CAN_MANUAL_RECOVERY_MODE) ||
		    (data->common.mode & CAN_MODE_MANUAL_RECOVERY) == 0U) {
			twai_hal_start_bus_recovery(&data->hal);
		}
	}

	err_cnt.tx_err_cnt = twai_hal_get_tec(&data->hal);
	err_cnt.rx_err_cnt = twai_hal_get_rec(&data->hal);

	can_fire_state_change_callbacks(dev, new_state, err_cnt);
}

static void IRAM_ATTR can_esp32_twaifd_isr(void *arg)
{
	const struct device *dev = arg;
	struct can_esp32_twaifd_data *data = dev->data;
	uint32_t events;

	events = twai_hal_get_events(&data->hal);

	if (events & TWAI_HAL_EVENT_RX_BUFF_FRAME) {
		can_esp32_twaifd_handle_rx(dev);
	}

	if (events & TWAI_HAL_EVENT_TX_BUFF_FREE) {
		can_esp32_twaifd_handle_tx(dev);
	}

	if (events & TWAI_HAL_EVENT_BUS_ERR) {
		twai_error_flags_t err_flags = twai_hal_get_err_flags(&data->hal);

		if (err_flags.bit_err) {
			CAN_STATS_BIT_ERROR_INC(dev);
		}
		if (err_flags.stuff_err) {
			CAN_STATS_STUFF_ERROR_INC(dev);
		}
		if (err_flags.form_err) {
			CAN_STATS_FORM_ERROR_INC(dev);
		}
		if (err_flags.ack_err) {
			CAN_STATS_ACK_ERROR_INC(dev);
		}
	}

	if (events & (TWAI_HAL_EVENT_BUS_OFF | TWAI_HAL_EVENT_ERROR_PASSIVE |
		      TWAI_HAL_EVENT_ERROR_WARNING | TWAI_HAL_EVENT_ERROR_ACTIVE)) {
		can_esp32_twaifd_update_state(dev, events);
	}
}

#if CAN_ESP32_TWAIFD_SLEEP_RETENTION_ENABLED
static esp_err_t can_esp32_twaifd_create_sleep_retention_cb(void *arg)
{
	uint32_t id = (uint32_t)(uintptr_t)arg;

	return sleep_retention_entries_create(twai_reg_retention_info[id].entry_array,
					      twai_reg_retention_info[id].array_size,
					      REGDMA_LINK_PRI_TWAI,
					      twai_reg_retention_info[id].module_id);
}

static void can_esp32_twaifd_sleep_retention_init(uint32_t id)
{
	sleep_retention_module_t module = twai_reg_retention_info[id].module_id;
	sleep_retention_module_init_param_t init_param = {
		.cbs = {.create = {.handle = can_esp32_twaifd_create_sleep_retention_cb,
				   .arg = (void *)(uintptr_t)id}},
		.attribute = SLEEP_RETENTION_MODULE_ATTR_ATTACH,
		.depends = RETENTION_MODULE_BITMAP_INIT(CLOCK_SYSTEM)};
	esp_err_t err = sleep_retention_module_init(module, &init_param);

	if (err == ESP_OK) {
		err = sleep_retention_module_allocate(module);
	}

	if (err == ESP_OK) {
		err = sleep_retention_module_attach(module);
	}

	if (err != ESP_OK) {
		LOG_WRN("TWAI%u sleep retention unavailable (err %d), "
			"peripheral power domain will stay on",
			(unsigned int)id, err);
	}
}
#endif /* CAN_ESP32_TWAIFD_SLEEP_RETENTION_ENABLED */

static int can_esp32_twaifd_init(const struct device *dev)
{
	const struct can_esp32_twaifd_config *cfg = dev->config;
	struct can_esp32_twaifd_data *data = dev->data;
	twai_hal_config_t hal_cfg;
	struct can_timing timing = {0};
	int err;
#ifdef CONFIG_CAN_FD_MODE
	struct can_timing timing_data = {0};
#endif

	sys_slist_init(&data->common.state_change_callbacks);
	k_mutex_init(&data->lock);

	if (!device_is_ready(cfg->clock_dev)) {
		LOG_ERR_DEVICE_NOT_READY(cfg->clock_dev);
		return -ENODEV;
	}

	err = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (err != 0) {
		LOG_ERR("pinctrl apply failed (err %d)", err);
		return err;
	}

	err = clock_control_on(cfg->clock_dev, cfg->clock_subsys);
	if (err != 0) {
		LOG_ERR("failed to enable TWAI clock (err %d)", err);
		return err;
	}

	err = esp_clk_tree_src_get_freq_hz(TWAI_CLK_SRC_DEFAULT,
					   ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED,
					   &data->clock_source_hz);
	if (err != 0) {
		LOG_ERR("failed to query TWAI clock frequency (err %d)", err);
		goto err_clock_off;
	}

	hal_cfg = (twai_hal_config_t){
		.controller_id = cfg->controller_id,
		.clock_source_hz = data->clock_source_hz,
		.intr_mask = TWAI_LL_DRIVER_INTERRUPTS | TWAIFD_LL_INTR_TX_FRAME,
		.retry_cnt = -1,
	};
	if (!twai_hal_init(&data->hal, &hal_cfg)) {
		LOG_ERR("twai_hal_init failed");
		err = -EIO;
		goto err_clock_off;
	}

	/*
	 * Cap the software TX pool at the number of TXT buffers the IP exposes.
	 * tx_sem counts available buffers so send() blocks once all are queued.
	 */
	data->tx_buffer_count = (uint8_t)MIN(twaifd_ll_get_tx_buffer_total(data->hal.dev),
					     CAN_ESP32_TWAIFD_TX_BUFFERS);
	k_sem_init(&data->tx_sem, data->tx_buffer_count, data->tx_buffer_count);

	err = can_calc_timing(dev, &timing, cfg->common.bitrate, cfg->common.sample_point);
	if (err < 0) {
		LOG_ERR("failed to compute timing (err %d)", err);
		goto err_clock_off;
	}
	err = can_esp32_twaifd_set_timing(dev, &timing);
	if (err != 0) {
		LOG_ERR("failed to apply nominal timing (err %d)", err);
		goto err_clock_off;
	}

#ifdef CONFIG_CAN_FD_MODE
	if (cfg->common.bitrate_data != 0) {
		err = can_calc_timing_data(dev, &timing_data, cfg->common.bitrate_data,
					   cfg->common.sample_point_data);
		if (err < 0) {
			LOG_ERR("failed to compute FD timing (err %d)", err);
			goto err_clock_off;
		}
		err = can_esp32_twaifd_set_timing_data(dev, &timing_data);
		if (err != 0) {
			LOG_ERR("failed to apply data timing (err %d)", err);
			goto err_clock_off;
		}
	}
#endif

	err = esp_intr_alloc(cfg->irq_source,
			     ESP_PRIO_TO_FLAGS(cfg->irq_priority) |
				     ESP_INT_FLAGS_CHECK(cfg->irq_flags) | ESP_INTR_FLAG_IRAM |
				     ESP_INTR_FLAG_INTRDISABLED,
			     can_esp32_twaifd_isr, (void *)dev, &data->intr_handle);
	if (err != 0) {
		LOG_ERR("intr alloc failed (err %d)", err);
		goto err_clock_off;
	}

#if CAN_ESP32_TWAIFD_SLEEP_RETENTION_ENABLED
	can_esp32_twaifd_sleep_retention_init((uint32_t)cfg->controller_id);
#endif

	data->state = CAN_STATE_STOPPED;
	return 0;

err_clock_off:
	(void)clock_control_off(cfg->clock_dev, cfg->clock_subsys);
	return err;
}

static DEVICE_API(can, can_esp32_twaifd_api) = {
	.get_capabilities = can_esp32_twaifd_get_capabilities,
	.start = can_esp32_twaifd_start,
	.stop = can_esp32_twaifd_stop,
	.set_mode = can_esp32_twaifd_set_mode,
	.set_timing = can_esp32_twaifd_set_timing,
#ifdef CONFIG_CAN_FD_MODE
	.set_timing_data = can_esp32_twaifd_set_timing_data,
#endif
#ifdef CONFIG_CAN_MANUAL_RECOVERY_MODE
	.recover = can_esp32_twaifd_recover,
#endif
	.send = can_esp32_twaifd_send,
	.add_rx_filter = can_esp32_twaifd_add_rx_filter,
	.remove_rx_filter = can_esp32_twaifd_remove_rx_filter,
	.get_state = can_esp32_twaifd_get_state,
	.get_core_clock = can_esp32_twaifd_get_core_clock,
	.get_max_filters = can_esp32_twaifd_get_max_filters,
	.timing_min = {
		.sjw = 1,
		.prop_seg = 0,
		.phase_seg1 = 1,
		.phase_seg2 = 1,
		.prescaler = 1,
	},
	.timing_max = {
		.sjw = 31,
		.prop_seg = 127,
		.phase_seg1 = 63,
		.phase_seg2 = 63,
		.prescaler = 255,
	},
#ifdef CONFIG_CAN_FD_MODE
	.timing_data_min = {
		.sjw = 1,
		.prop_seg = 0,
		.phase_seg1 = 1,
		.phase_seg2 = 1,
		.prescaler = 1,
	},
	.timing_data_max = {
		.sjw = 16,
		.prop_seg = 31,
		.phase_seg1 = 31,
		.phase_seg2 = 16,
		.prescaler = 255,
	},
#endif
};

