zephyrproject-rtos/zephyr/drivers/can/can_esp32_twaifd.c
/*
 * Derive the hardware controller index (0 or 1) from the node's reg address
 * by matching it against DR_REG_TWAI0_BASE and DR_REG_TWAI1_BASE. The reg
 * address in devicetree is already the identity - no separate controller-id
 * property needed in the binding. Returns -1 if the address matches neither
 * known instance so a BUILD_ASSERT() can flag the bad configuration.
 */
#define CAN_ESP32_TWAIFD_HW_INSTANCE(inst)                                                         \
	(DT_INST_REG_ADDR(inst) == DR_REG_TWAI0_BASE   ? 0                                         \
	 : DT_INST_REG_ADDR(inst) == DR_REG_TWAI1_BASE ? 1                                         \
						       : -1)

#define CAN_ESP32_TWAIFD_INIT(inst)                                                                \
	BUILD_ASSERT(CAN_ESP32_TWAIFD_HW_INSTANCE(inst) >= 0,                                      \
		     "TWAI-FD reg address does not match a known controller base");                \
	PINCTRL_DT_INST_DEFINE(inst);                                                              \
                                                                                                   \
	static const struct can_esp32_twaifd_config can_esp32_twaifd_cfg_##inst = {                \
		.common = CAN_DT_DRIVER_CONFIG_INST_GET(inst, 0, 5000000),                         \
		.base = DT_INST_REG_ADDR(inst),                                                    \
		.controller_id = CAN_ESP32_TWAIFD_HW_INSTANCE(inst),                               \
		.clock_dev = DEVICE_DT_GET(DT_INST_CLOCKS_CTLR(inst)),                             \
		.clock_subsys = (clock_control_subsys_t)DT_INST_CLOCKS_CELL(inst, offset),         \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(inst),                                      \
		.irq_source = DT_INST_IRQ_BY_IDX(inst, 0, irq),                                    \
		.irq_priority = DT_INST_IRQ_BY_IDX(inst, 0, priority),                             \
		.irq_flags = DT_INST_IRQ_BY_IDX(inst, 0, flags),                                   \
	};                                                                                         \
                                                                                                   \
	static struct can_esp32_twaifd_data can_esp32_twaifd_data_##inst;                          \
                                                                                                   \
	CAN_DEVICE_DT_INST_DEFINE(inst, can_esp32_twaifd_init, NULL,                               \
				  &can_esp32_twaifd_data_##inst, &can_esp32_twaifd_cfg_##inst,     \
				  POST_KERNEL, CONFIG_CAN_INIT_PRIORITY, &can_esp32_twaifd_api);

DT_INST_FOREACH_STATUS_OKAY(CAN_ESP32_TWAIFD_INIT)
